# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
one = pd.Series(np.random.randint(1, high=5, size=100))
two = pd.Series(np.random.randint(1, high=4, size=100))
three = pd.Series(np.random.randint(10000, high=30000, size = 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df = pd.concat([one, two, three], axis=1)
df.head()

   0  1      2
0  2  3  12464
1  2  1  10963
2  2  2  29488
3  4  3  14155
4  3  3  11136

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df.rename(columns={0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      2       3            12464
1      2       1            10963
2      2       2            29488
3      4       3            14155
4      3       3            11136

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
bigcolumn = pd.concat([one, two, three], axis = 0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn.head()

<class 'pandas.core.frame.DataFrame'>

   0
0  2
1  2
2  2
3  4
4  3

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [6]:
bigcolumn.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [7]:
bigcolumn.reset_index(drop=True)

         0
0        2
1        2
2        2
3        4
4        3
..     ...
295  22006
296  16786
297  21309
298  26900
299  11902

[300 rows x 1 columns]